package com.sicuanyangguang;
/*
* 数据结构：数据结构是计算机底层存储，组织数据的方式
* 是指数据之间是以什么样的方式排列在一起的。是为了更加方便的使用和管理数据，要结合具体的业务场景。
* 常见的数据结构 栈  队列  数组  链表  二叉树  二叉树查找  平衡二叉树  红黑树
*
* 栈的特点 ： 后进先出，先进后出，联想成子弹一样，先压进去的子弹最后被打出去
*
* 队列的特点： 先进先出，后进后出  联想成排队买饭，你排在前面就可以先把饭买到，然后先离开。
*
* 数组的特点： 查询数据是通过地址值和索引定位的，查询任意数据消耗的时间是相同的，并且元素在内存中是连续的。
* 但是删除数据的时候，要将原始的数据删除掉，然后，同时每个数据前移动，同时添加的时候，每一个元素往后移动
* 数组是一种查询块，增删慢的数据模型
*
* 链表： 链表中的节点是独立的对象，在内存当中是不连续的，每一个结点包含数据值，所以查询慢。但是增删就比较快了。
* 链表是有单向链表和双向链表的。单向链表是只能从前往后查找，而双向链表既可以从前往后，也可以从后往前查找。
*
*
*
*
* */
public class HJiHeX7 {
    public static void main(String[] args) {

    }
}
